In [ ]:
import pandas as pd
import numpy as np 
from io import StringIO,BytesIO

In [8]:
data = pd.read_excel(r'C:\Filtering_data.xlsx', sheet_name=0)
data

    ID       Name  Age     City  Salary
0    1       Aman   25    Delhi   50000
1    2       Riya   22   Mumbai   60000
2    3      Vikas   30    Delhi   55000
3    4       Neha   28  Chennai   58000
4    5      Ankit   26   Mumbai   52000
5    6      Pooja   24    Delhi   57000
6    7      Rahul   29     Pune   53000
7    8     Simran   27   Mumbai   56000
8    9      Tanya   23    Delhi   54000
9   10  Siddharth   31  Chennai   59000
10  11      Rohit   32     Pune   60000
11  12      Sonia   21    Delhi   51000
12  13     Aakash   26   Mumbai   58000
13  14      Priya   25     Pune   54000
14  15      Karan   29  Chennai   57000
15  16      Megha   28    Delhi   59000
16  17     Deepak   24   Mumbai   52000
17  18       Isha   22     Pune   53000
18  19     Nikhil   30  Chennai   56000
19  20       Alka   27    Delhi   55000

In [9]:
data2 = pd.read_excel(r'C:\Filtering_data.xlsx', sheet_name=1)

In [10]:
data2

,employee_id,first_name,last_name,email,department,salary,joining_date,age,bonus,Hand_on_salary,deduction,final_pay
0,1,Joshua,Ramos,alexandra29@gmail.com,Operations,65313.80,2024-05-23,42,71845.180,137158.980,1959.4140,63354.3860
1,2,Christina,Clark,littlekyle@yahoo.com,IT,58827.32,2021-10-02,46,64710.052,123537.372,1764.8196,57062.5004
2,3,Jonathon,Sullivan,tannerivan@johnson.com,Operations,57427.31,2020-04-30,50,63170.041,120597.351,1722.8193,55704.4907
3,4,Clinton,Aguirre,jamieortega@yahoo.com,HR,45352.74,2021-04-04,55,49888.014,95240.754,1360.5822,43992.1578
4,5,Veronica,Weber,trevinosteven@ramos.com,Operations,78772.56,2020-10-06,51,86649.816,165422.376,2363.1768,76409.3832
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Brandi,Cowan,qsimmons@gmail.com,Finance,97102.57,2024-11-07,41,106812.827,203915.397,2913.0771,94189.4929
996,997,Michael,Gray,curtisruben@gmail.com,IT,40509.73,2023-03-11,37,44560.703,85070.433,1215.2919,39294.4381
997,998,Cassandra,Rodriguez,brittneytran@dunlap.info,Finance,72886.03,2024-07-25,32,80174.633,153060.663,2186.5809,70699.4491
998,999,April,Howard,crystalcohen@smith.com,Operations,32177.63,2022-04-06,29,35395.393,67573.023,965.3289,31212.3011
999,1000,Benjamin,Palmer,darylsnyder@williams.com,IT,87670.82,2020-04-03,38,96437.902,184108.722,2630.1246,85040.6954